package com.example.bozhitong;

public class MyString {
	public String MyStringUtils() {
		String protocol = "第一条 特别提示\n1、北京淘技宝科技网络技术有限公司（以下简称“淘技宝科技”）在此特别提醒您（用户）在注册成为用户之前，请"
				+ "认真阅读本《淘技宝软件许可及服务协议》（以下简称“协议”），确保您充分理解本协议中各条款，包括免除淘技宝科技责任的条款及限"
				+ "制用户权利的条款。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权注册、登录或使用本协议所涉服务"
				+ "。您的注册、登录、使用等行为将视为对本协议的接受，并同意接受本协议各项条款的约束。"
				+ "\n2、本协议约定淘技宝科技与用户之间关于“淘技宝”软件服务（以下简称“服务”）的权利义务。“用户”是指注册、登录、使用本服务的个人"
				+ "。本协议可由淘技宝科技随时更新， 更新后的协议条款一旦公布即代替原来的协议条款，恕不再另行通知用户可在淘技宝科技网站（"
				+ "http://www.taojibao.com/）查阅最新版协议条款。在淘技宝科技修改协议条款后，如果用户不接受修改后的条款，请立即停止"
				+ "使用淘技宝科技提供的服务，用户继续使用淘技宝科技提供的服务将被视为接受修改后的协议。"
				+ "\n第二条 账号注册"
				+ "\n1、用户在使用本服务前需要注册一个“淘技宝”账号。“淘技宝”账号应当使用手机号码绑定注册， 请用户使用尚未与“淘技宝”账号绑定的手机号码，"
				+ "以及未被淘技宝科技根据本协议封禁的手机号码注册“淘技宝”账号。 淘技宝科技可以根据用户需求或产品需要对账号注册和绑定的方式进行变更，而无须事先"
				+ "通知用户。"
				+ "\n2、如果注册申请者有被淘技宝科技封禁的先例或涉嫌虚假注册及滥用他人名义注册，及其他不能得到许可的理由， 淘技宝科技将拒绝其注册申请。"
				+ "\n3、注册成功后，用户可以通过“淘技宝”软件中“我的账号”界面浏览或更改本人的个人信息。 但不能修改系统自动分配给用户的ID-“淘技宝号”。"
				+ "\n4、用户注册时所填写的个人信息如有变动，用户需通过“我的账号”界面及时更改。 用户因未及时更改造成的损失淘技宝科技概不负责。"
				+ "\n第三条 服务内容"
				+ "\n1、本服务的具体内容由淘技宝科技根据实际情况提供，包括但不限于："
				+ "\n（1） 广告播放：用户安装运行“淘技宝”软件后可以在软件界面观看广告；"
				+ "\n（2） 淘币制：完成本协议第四条相关规定的用户可获得淘币奖励；"
				+ "\n（3） 淘币兑换：用户可以使用所获淘币兑换淘技宝科技的合作供应商所提供的商品及服务。"
				+ "\n\n2、用户可以浏览淘技宝科技网站(http://www.taojibao.com/)了解淘技宝科技提供的服务内容。"
				+ "\n3、在遵守相关法律法规前提下，根据合作广告主的要求，淘技宝科技有权决定用户在“淘技宝”软件界面上看到的广告内容。"
				+ "\n4、用户使用获得的淘币能够兑换的商品及服务的种类与兑换价格由淘技宝科技全权决定。第四条 使用规则"
				+ "\n1、用户需从官方渠道下载安装淘技宝科技提供的“淘技宝”软件（App）。"
				+ "\n2、用户安装运行“淘技宝”软件后，解锁或打开锁屏页面链接、下载应用等均可获取淘币。"
				+ "\n3、用户可以在“淘技宝”软件中查看自己累计的淘币情况。"
				+ "\n4、用户“淘技宝”软件中显示的累计淘币数量可能与淘技宝科技服务器端存在统计差异，实际淘币数量以服务器端为准。"
				+ "\n5、用户淘币作为“淘技宝”软件中的虚拟记录符号，不能在用户间相互转让， 不能使用包括人民币在内的任何法定货币购买，"
				+ "不具有在“淘技宝”软件以外的环境中进行交易结算的功能。";
		return protocol;
	}

	public String MyContent() {
		String content = "\u3000\u3000中国天渊投资集团有限公司成立于2001年，是一家以资本运营为导向，产业投资为抓手，智慧城市运营为依托，集资本运作与产业运营为一体的多元化投资控股集团。集团总部位于广州，并在北京、成都等地设有区域总部，旗下拥有多家全资、控股及参股企业，是国家发改委中国智慧城市发展联盟理事成员单位。\n\u3000\u3000集团主要业务涵盖资本运营、城市运营和产业运营。其中，资本运营业务：包括股权投融资、证券投融资、并购重组、资产管理等；城市运营业务：包括智慧城市（含政务、交通、医疗、教育等）建设运营，智慧商城开发运营，智慧社区服务运营，智慧酒店、物流、农业投资运营等；产业运营业务：包括智慧园区建设运营、智能产品制造、智能系统集成、工程咨询服务、现代商贸、国际贸易等。集团下设基础研究院，致力于智慧城市的前沿技术研究、物联网运营平台研发和智能产品开发。\n\u3000\u3000集团以“中国天渊西部智慧城•智慧低碳产业园”示范基地为试点，通过市场化运作方式，率先在全国探索智慧产业之产园融合和产城融合的创新实践新模式。并以此为基础，形成以服务家庭的智慧家居为点，以服务社区的智慧社区为线，以服务城市的智慧城市为面的多层次服务格局；同时在地理空间上，形成点线面的全国布局，并最终构建立体式、网络化智慧城市及“智•生活”的运营服务平台。\n\u3000\u3000集团是广东省公共安全技术防范协会理事单位，拥有“电子与智能化工程专项承包”、“智能化系统设计专项”、“计算机信息系统集成”、“技术安全防范设计、施工、维修”、“工程造价咨询企业甲级”、“输变电工程专业承包”、“地质灾害治理工程”、“地基基础工程专业承包”、ISO国际质量管理体系认证等多项资质。集团长期专注于智能化、智慧+及安全技术防范领域的技术、产品和应用研发，在家居智能化、酒店智能化、工业智能化、商业智能化、智慧城市、智慧+行业应用，以及物联网、云服务、工程造价咨询、工程勘察、地质灾害治理、输变电工程、地基基础工程、环境管理等领域拥有完整成熟的整体解决方案和丰富的实施经验。\n\u3000\u3000天渊“智•生活”服务模式，其核心在于天渊智慧社区O2O云服务平台的建设，主要包含三方面内容：（1）物业管理的移动互联网+物联网化（含常用智能化弱电系统接入）；（2）小区社交的粘度建立；（3）社区商业的发展。\n\u3000\u3000天渊“智•生活”服务模式，充分运用物联网、移动互联网、大数据、云计算技术，实现智慧社区O2O线上线下的高度融合，将以前单纯对物业的管理，扩展到对人、社群和物业的综合管理及服务，并通过天渊智慧云服务平台，为业主、物管、商家等提供增值服务，从而大大提升项目的品牌度与美誉度。";
		return content;
	}
}
